I've taken a look over this issue - but I'm not finding any issues when deploying these examples in Joyent's "us-west-1" or in COAL (laptop). I do have CNS setup and running.

I'm running:
```
$ terraform version
Terraform v0.12.10
+ provider.triton v0.6.0
```

My example:
```
data "triton_image" "lx_ubuntu" {
  name        = "ubuntu-16.04"
  most_recent = true
}

resource "triton_machine" "test" {
  name    = "test"
  package = "${local.package}"
  image   = "${data.triton_image.lx_ubuntu.id}"

  #tags = {
  #  role = "test"
  #}

  cns {
    services = [
      "1.2.3"
    ]
  }
}
```

I am using the latest Terraform (0.12) and 
```
terraform apply
data.triton_image.lx_ubuntu: Refreshing state...
triton_machine.test: Refreshing state... [id=31a59503-5f46-c1a6-c3ad-d9d0ff94c4ae]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # triton_machine.test will be created
  + resource "triton_machine" "test" {
      + compute_node                = (known after apply)
      + created                     = (known after apply)
      + dataset                     = (known after apply)
      + deletion_protection_enabled = false
      + disk                        = (known after apply)
      + domain_names                = (known after apply)
      + firewall_enabled            = false
      + id                          = (known after apply)
      + image                       = "7b5981c4-1889-11e7-b4c5-3f3bdfc9b88b"
      + ips                         = (known after apply)
      + memory                      = (known after apply)
      + name                        = "test"
      + package                     = "sample-1G"
      + primaryip                   = (known after apply)
      + root_authorized_keys        = (known after apply)
      + type                        = (known after apply)
      + updated                     = (known after apply)

      + cns {
          + services = [
              + "1.2.3",
            ]
        }

      + nic {
          + gateway = (known after apply)
          + ip      = (known after apply)
          + mac     = (known after apply)
          + netmask = (known after apply)
          + network = (known after apply)
          + primary = (known after apply)
          + state   = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

triton_machine.test: Creating...
triton_machine.test: Still creating... [10s elapsed]
triton_machine.test: Still creating... [20s elapsed]
triton_machine.test: Creation complete after 25s [id=7d0c5f88-5dbc-e9eb-c5eb-e560d923f922]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Can those that are hitting this issue confirm if they have CNS setup in their Triton installation?